{"title":"Present Perfect or Past Simple","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","type":1,"contents":[{"id":0,"sentence":["'I "," (not meet) Frank for two weeks. Does he still work here?' 'I don't know. I "," (not see) him since last week's meeting.'"],"solutions":[["haven't met","have not met"],["haven't seen","have not seen"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: haven't met. We need present perfect here because the time period 'for two weeks' comes up to now.","Corr: haven't seen. We need present perfect here because we consider the time period that started at last week's meeting and comes up to now."],"teacher":["Nincs.","Nincs."]},{"id":1,"sentence":["'How long "," (Sally \/ be) the manager at this department?' 'She "," (come) here six years ago. First, for about a year she ","(be) a manager assistant, but then she "," (become) the manager.'"],"solutions":[["has Sally been"],["came"],["was"],["became"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: has Sally been. We need present perfect here because Sally is still the manager and we ask about a time period (how long) that comes up to now.","Corr: came. There's a time adverb: six years ago, so we need past simple.","Corr: was. Although there is a 'for about year' time adverb in the sentence, this time period doesn't come up to now, it ended in the past.","Corr: became. We need the past simple here because there is a time adverb: but then."],"teacher":["No.","NO.","No.","No."]},{"id":2,"sentence":["'I'm on a slimming diet and I "," (lose) six pounds since last month.' 'Congratulations. I "," (lose) a few pounds too, since I "," (begin) playing tennis.'"],"solutions":[["have lost"],["have lost"],["began"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have lost. We need present perfect because of 'since last month', which means we consider the time period since last month up to now.","Corr: have lost. We need present perfect here because we consider the time period that started in the past (when he started...) and comes up to now.","Corr: began. We need past simple here because it is in the 'since' part of the sentence."],"teacher":["No.","No.","No."]}]}