{"title":"Conditionals Type 1 or Type 2 - 3","instructions":"Complete the sentences to make type 1 or type 2 conditional sentences.","weight":"2","exa":null,"type":"1","helps":["conditionals_all.html"],"contents":[{"id":0,"sentence":["They would come with us to the pub if they "," (be) cool, but they're just jerks."],"solutions":[["were"]],"userTipps":"GGG_GGG_","explain":["Corr: were. There's 'would' in the main clause, so it's type 2 conditional, and we have to use 'were'."]},{"id":1,"sentence":["Do you think they will cooperate if I "," (blackmail) them with this sensitive information?"],"solutions":[["blackmail"]],"userTipps":"GGG_GGG_","explain":["Corr: blackmail. There's 'will' in the main clause, so it's type 1 conditional, and we need present simple."]},{"id":2,"sentence":["What "," you do if one of your cousins wanted to live with you?"],"solutions":[["would"]],"userTipps":"GGG_GGG_","explain":["Corr: would. It's type 2 conditional because there's past tense in the if-clause, so we need 'would'."]},{"id":3,"sentence":["If we "," (happen) to find the solution before them, I'd invite everybody for a beer."],"solutions":[["happened"]],"userTipps":"GGG_GGG_","explain":["Corr: happened. There's 'would' in the main clause, so it's type 2 conditional, and we need past tense in the if-clause."]},{"id":4,"sentence":["I "," (help) them only if they pay me. Otherwise, I "," (say) no to them."],"solutions":[["will help"],["will say"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: will help. There's is present tense in the if-clause, so we need 'will' in the main clause because it's type 1 conditional.","Corr: will help. There's is present tense in the if-clause, so we need 'will' in the main clause because it's type 1 conditional."]},{"id":5,"sentence":["I "," (not help) you do your maths homework even if "," (be) good at maths, but I'm not."],"solutions":[["wouldn't help","would not help"],["were","was"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: wouldn't help. We need type 2 conditional here because the speaker says he or she is not good at maths (...but I'm not.), so it's about an imagined situation.","Corr: were. We need type 2 conditional here because the speaker says he or she is not good at maths (...but I'm not.), so it's about an imagined situation."]},{"id":6,"sentence":["Nobody "," (notice) if we go home now. If someone does, we "," (bribe) him or her."],"solutions":[["will notice"],["will bribe"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: will notice. It's type 1 conditional because there's present tense in the if-clause.","Corr: will bribe. It's type 1 conditional because there's present tense in the if-clause."]},{"id":7,"sentence":["If you "," (not do) this task now, then who will do it?"],"solutions":[["don't do"]],"userTipps":"GGG_GGG_","explain":["Corr: don't do. It's type 1 conditional and we need present tense in the if-clause because there's 'will' in the main clause."]},{"id":8,"sentence":["Don't park your car here. If you do, your car "," (be) towed away."],"solutions":[["will be"]],"userTipps":"GGG_GGG_","explain":["Corr: will be. It's conditional type 1, and we need 'will' in the main clause because there's present tense in the if-clause."]},{"id":9,"sentence":["If we "," (not take) his advice, he would be very angry and he "," (never give) us any advice any more."],"solutions":[["didn't take"],["would never give"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: didn't take. We need past tense here because there's 'would' in the main clause, so it's type 2 conditional.","Corr: would never give. It's type 2 conditional because there's 'would' in the previous clause and past tense in the if-clause."]}]}