{"title":"Tenses - four common tenses","instructions":"Complete the sentences with the verbs in brackets. Use B1present simpleB2, B1present continuousB2, B1past simpleB2 or B1present perfectB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'I "," (get) this parrot last month. It ","(have) a beautiful plumage, ","it?' 'Yes, it's very nice. ","you "," (let) it out of its cage yet?' 'No, I ",".  Yesterday I ","(open) the door of the cage, but it ","(not come) out.'"],"solutions":[["got"],["has"],["doesn't"],["Have"],["let"],["haven't"],["opened"],["didn't come","did not come"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: got. It's past simple because of the time adverb 'yesterday'.","Corr: has. It's about a present fact. The verb 'have' is not used in the continuous if it expresses possession.","Corr: doesn't. It's a question tag, and as the sentence is in the present simple, we use the auxiliary 'does'.","Corr: Have. It's present perfect because it's about a time period up to now and there's 'yet' at the end of the sentence.","Corr: let. It's present perfect because it's about a time period up to now and there's 'yet' at the end of the sentence.","Corr: haven't. It's a short answer to a question in present perfect, so we need to use the auxiliary 'have' or 'haven't'.","Corr: opened. It's past simple because of the time adverb 'yesterday'.","Corr: didn't come. It's past simple because of the time adverb 'yesterday'."]},{"id":1,"sentence":["'I "," (train) hard now because I "," (want) to lose some weight.' 'Really? You "," (not look) too fat.' 'Thanks, that's very kind of you, but I "," (put) on some pounds in the last few months. I "," (not know) why. I "," (never eat) fattening dishes.'"],"solutions":[["am training"],["want"],["don't look"],["have put"],["don't know"],["never eat","have never eaten"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: am training. It's present continuous because this action is happening at the moment and it's temporary.","Corr: want. It's present simple because it's about a present status, and the verb 'want' is not used in the continuous.","Corr: don't look. It's present simple because it's about a present status. The verb 'look' in the sense 'have an appearance' is usually not used in the continuous.","Corr: have put. It's present perfect because it has happened in a time period up to now. It's indicated by the adverb 'in the last few months'.","Corr: don't know. It's present simple because it's about a present status. The verb 'know' is not used in the continuous.","Corr: never eat or have never eaten. If we refer to a present habit, present simple (never eat) is correct, but if we speak about 'in the last few months', present perfect (have never eaten) is correct."]},{"id":2,"sentence":["'I "," (write) this e-mail to Sally. We "," (meet) at a team building training last month, and since then I "," (write) an e-mail to her every day.' 'Really? I "," (not know) that. Why "," you "," (not tell) me this earlier?'"],"solutions":[["am writing"],["met"],["have written"],["didn't know","did not know"],["did","didn't"],["tell","not tell"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: am writing. It's present continuous because it's happening at the moment of speech.","Corr: met. It's past simple because of the time adverb 'last month'.","Corr: have written. It's present simple because it's about a time period that starts in the past and comes up to now. There's 'since then' indicating when the time period started.","Corr: didn't know. It's past simple because 'I didn't know it' earlier, now 'I know it'.","Corr: did or didn't. It's past simple because of the time adverb 'earlier'.","Corr: tell or not tell. It's past simple because of the time adverb 'earlier'."]}]}