{"title":"Tenses - four common tenses","instructions":"Complete the sentences with the verbs in brackets. Use B1present simpleB2, B1present continuousB2, B1past simpleB2 or B1present perfectB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'My father "," (want) to go to work by motorbike, so he "," (buy) one last week.' 'Really? Is it good?' 'I ","(not know). I ","(not see) it yet. He just ","(phone) me yesterday to tell me this news.'"],"solutions":[["wanted"],["bought"],["don't know","do not know"],["haven't seen","have not seen"],["phoned"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: wanted. The sentence contains 'last week', so past simple is needed.","Corr: bought. The sentence contains 'last week', so past simple is needed.","Corr: don't know. The speaker does not know it at the moment, so present simple is needed.","Corr: haven't seen. It's present perfect because there's 'yet' at the end of the sentence and it's about the time up to now.","Corr: phoned. We need past simple here because of the time adverb 'yesterday'."]},{"id":1,"sentence":["'I ","(look) for a new job, but I ","(not find) anything good.' 'I'm sorry. When ","you ","(lose) your job?' 'Two months ago. They ","(say) you "," (need) at least six months to find a new job these days.'"],"solutions":[["am looking"],["haven't found","have not found"],["did"],["lose"],["say"],["need"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: am looking. It's happening now, so we need present continuous.","Corr: haven't found. We need present perfect because the speaker hasn't found a job yet, that is, up to now.","Corr: did. We need past simple because there's 'when' in the sentence, so it asks about a past event.","Corr: lose. We need past simple because the sentence asks about a past event. In questions, when we use 'did', we use the base form of the verb.","Corr: say. It's a general statement, so we need present simple.","Corr: need. It's a general statement, it's true in the present."]},{"id":2,"sentence":["'What "," you ","(read)?' 'It's a magazine about weapons. I "," (buy) it every month.' 'Is it interesting?' 'Usually it is, but I ","(read) only two pages of this copy, so I ","(not know).'"],"solutions":[["are"],["reading"],["buy"],["have read"],["don't know","do not know"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: are. We need present continuous because the question is about an action that is going on at the moment of speech.","Corr: reading. We need present continuous because the question is about an action that is going on at the moment of speech.","Corr: buy. We need present simple because of the time adverb 'every month'. So it's a repeated action.","Corr: have read. We need present perfect because it's about a time period up to now.","Corr: don't know. We need present simple  because this statement about a present status. The verb 'know' is not used in the continuous."]}]}