{"title":"Tenses - four common tenses","instructions":"Complete the sentences with the verbs in brackets. Use B1present simpleB2, B1present continuousB2, B1past simpleB2 or B1present perfectB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'How often "," you "," (visit) your grandmother?' 'I "," (try) to visit her every month, but sometimes I'm too busy to travel so much. You ","(know), she "," (live) in Brighton.' 'I ","(see).' 'However, tomorrow morning I "," (travel) there, because last month I "," (not visit) her and so I "," (not see) her for two months.'"],"solutions":[["do"],["visit"],["try"],["know"],["lives"],["see"],["am travelling"],["didn't visit","did not visit"],["haven't seen","have not seen"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: do. It's present simple because the question is about a repeated action. It contains 'how often'.","Corr: visit. It's present simple because the question is about a repeated action. It contains 'how often'.","Corr: try. It's present simple because it's about a repeated action shown by the time adverb 'every month'.","Corr: know. It's about the present and the verb 'know' is not used in continuous tenses. So only present simple is correct.","Corr: lives. It's present simple because the granny lives there permanently, so it is not a temporary thing.","Corr: see. It's present simple. The verb 'see' here means 'understand' and it's not used in the continuous.","Corr: am travelling. We need present continuous because this action is a future plan and we know when it is happening, that is, there's a time adverb: tomorrow.","Corr: didn't visit. It's past simple because of the time adverb 'last month'.","Corr: haven't seen. It's present perfect because we say how long we have not done something and this time period (two months) comes up to the present."]},{"id":1,"sentence":["'How's your husband's new job?' 'He "," (say) he ","(like) it, but since he ","(start) there just last week, he ","(not have) the time to meet every one of his co-workers.  ' "," he ","(like) his boss, too?' 'I ","(not know). He ","(not say) anything about his boss yet.'"],"solutions":[["says"],["likes"],["started"],["hasn't had","has not had"],["Does"],["like"],["don't know","do not know"],["hasn't said","has not said"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: says or has said. If we quote him in a general sense, present simple is correct. But if we refer to the fact that he said it in the past at an unspecified time, present perfect can be correct, too.","Corr: likes. It's a present status. The verb 'like' is not used in the continuous.","Corr: started. It's past simple because of the time adverb 'last week'.","Corr: hasn't had. It's about a time period up to the present, so it's present perfect. There's no 'yet' at the end of the sentence, but we could put it there.","Corr: Does. It's a question about a present status, and the verb 'like' is not used in the continuous.","Corr: like. It's a question about a present status, and the verb 'like' is not used in the continuous.","Corr: don't know. It's about a present status, and the verb 'know' is not used in the continuous.","Corr: hasn't said. It's present perfect because it's about a time period up to the present, and there's 'yet' at the end of the sentence."]},{"id":2,"sentence":["'Yesterday Trudy ","(come) over to my place. We "," (chat) a bit and then we "," (see) a DVD, "," (drink) a few glasses of wine, so I "," (go) to bed a bit late.' 'Oh, I see. That "," (explain) why you're so sleepy now and why you "," (work) so slowly.'"],"solutions":[["came"],["chatted"],["saw"],["drank"],["went"],["explains"],["are working"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: came. It's past simple because of 'yesterday'.","Corr: chatted. The adverb that refers to this verb is still 'yesterday'. It's not past continuous because nothing interrupted them while they chatted.","Corr: saw. The time is still 'yesterday', so it's past simple.","Corr: drank. It happened yesterday, so it's past simple.","Corr: went. It happened yesterday, so it's past simple.","Corr: explains. When 'explain' is used in the sense 'to give reasons', it's not used in the continuous.","Corr: are working. It's happening at the moment of speaking, so it's present continuous."]}]}