{"title":"Present perfect - have you ever","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["I "," (never eat) sushi, so I'd like to try it someday.' 'I "," (eat) it last week and it "," (be) delicious.'"],"solutions":[["have never eaten"],["ate"],["was","is"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have never eaten. The person has not eating sushi in his or her life up to the present moment, so it's present perfect.","Corr: ate. It's past simple because it happened last week.","Corr: was or is. If the person refers to last week, we can use 'was'. But if the speaker refers to general time, we can use 'is'."]},{"id":1,"sentence":["I "," (be) to England several times, but I "," (never be) to London. I know it's strange."],"solutions":[["have been"],["have never been"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: have been. It's about the person's life up to now: he or she has done this several times.","Corr: has never been. It's about the person's life up to now: he or she has not done it in his or her life up to now."]},{"id":2,"sentence":["'Tomorrow we're travelling to Grenoble, but, as I "," (never ski) before, I'm worried a bit.' 'Well, I understand you. I "," (not ski) before, either. Though last year we "," (go) on holiday in Aspen. However, I "," (not try) to ski.'"],"solutions":[["have never skied"],["haven't skied","have not skied"],["went"],["didn't try","did not try"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: have never skied. It's about life experience, the person hasn't done it up to now.","Corr: have never skied. It's about life experience, the person hasn't done it up to now.","Corr: went. We need past simple because of the time adverb 'last year'.","Corr: didn't try. Because of the time adverb 'last year', we need past simple here."]},{"id":3,"sentence":["'"," you "," (ever swim) in the sea?' 'No, I "," . I can't swim. And you?' 'Well, I "," (swim) in the see several times. You know, I "," (grow) up in Marseilles.'"],"solutions":[["Have"],["ever swum"],["haven't"],["have swum"],["grew"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's about the person's life up to now, so it's present perfect.","Corr: ever swum. It's about the person's life up to now, so it's present perfect.","Corr: haven't. It's a short answer to a question in present perfect, so we just repeat the auxiliary verb 'have' or if it is a negative answer 'haven't'. In short answers only the contracted form is acceptable.","Corr: have swum. It's about the person's life up to now, so it's present perfect.","Corr: grew. We need past simple because the person is an adult now, so he or she lived in Marseilles only in his or her childhood."]},{"id":4,"sentence":["'"," you "," (like) the film last night?' 'Yes, very much. It "," fantastic. I think it is the best film I "," (ever see)."],"solutions":[["Did"],["like"],["was","is"],["have ever seen"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Did. We need past simple because of the time adverb 'last night'.","Corr: like. We need past simple because of the time adverb 'last night'.","Corr: was or is. If we refer to last night, 'was' is correct. If we refer to general time, 'is' is correct.","Corr: have ever seen. It's about the person's life up to now, so it's present perfect."]},{"id":5,"sentence":["'You see, I drive very carefully because I "," (have) a car accident some years ago.' 'Ah, I see. I "," (not have) a car crash, but I can understand.'"],"solutions":[["had"],["haven't had","have not had"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: had. Because of the time adverb 'some years ago', it's past simple.","Corr: haven't had. The speaker is speaking about his or her life experience up to the present moment, so it's present perfect."]}]}