{"title":"Present Perfect - Already, Yet 1","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'I "," (already buy) the Christmas presents!' 'Really? But it's only August.'"],"solutions":[["have already bought"]],"userTipps":"GGG_GGG_","explain":["Corr: have already bought. It's present perfect because there's no time adverb in the sentence."]},{"id":1,"sentence":["'"," the company "," (receive) your CV?' 'I don't know. They "," (not notify) me yet.'"],"solutions":[["Has"],["received"],["haven't notified","have not notified"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: Has. We need present perfect here because it's a question about whether an action has happened up to now or not.","Corr: received. We need present perfect here because it's a question about whether an action has happened up to now or not.","Corr: haven't notified. It's present perfect because it's about an action that has not happened up to now in contrast with our expectations."]},{"id":2,"sentence":["'I "," (order) my new mobile two weeks ago, but they "," (not deliver) it yet.' '"," you "," (phone) the delivery company yet?' 'No, I "," . Maybe tomorrow.'"],"solutions":[["ordered"],["haven't delivered"],["Have"],["phoned"],["haven't"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: ordered. It's past simple because there's a time adverb 'two weeks ago' in the sentence.","Corr: haven't delivered. It's present perfect because this action hasn't happened up to now.","Corr: Have. It's present perfect because it's a question about whether an action has happened up to now or not.","Corr: phoned. It's present perfect because it's a question about whether an action has happened up to now or not.","Corr: haven't. It's present perfect. It's a short answer to the previous question in present perfect."]},{"id":3,"sentence":["'"," Steve "," (finish) his project?' 'No, he "," . He "," (be) at half way through this time yesterday.'"],"solutions":[["Has"],["finished"],["hasn't","has not"],["was"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Has. It's present perfect, it's a question whether an action has happened up to now or not.","Corr: finished. It's present perfect, it's a question whether an action has happened up to now or not.","Corr: hasn't. It's present perfect. It's a short answer to the previous question in present perfect.","Corr: was. It's past simple because there's a time adverb 'yesterday' in the sentence."]},{"id":4,"sentence":["'What's the correct solution?' 'Dunno. I "," (forget) it already. Yesterday I "," (remember), but now not.'"],"solutions":[["have forgotten"],["remembered"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: have forgotten. It's present perfect because the speaker wants to express that something happened earlier than expected.","Corr: remembered. It's past simple because there's a time adverb in the sentence 'yesterday'."]},{"id":5,"sentence":["'What's Peter's new book like?' 'Well, I "," (not read) it. Actually, I "," (not even buy) it yet.'"],"solutions":[["haven't read","have not read"],["haven't even bought","have not even bought"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: haven't read. It's present perfect because it's about an action that has not happened up to now contrary to our expectations.","Corr: haven't even bought. It's present perfect because it's about an action that has not happened up to now contrary to our expectations."]}]}