{"title":"Present Perfect Simple or Continuous - for, since - 2","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2, B1present perfect continuousB2 or B1past simpleB2.","weight":"3","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'My boss "," (hate) me ever since I "," (start) working here.' 'You can't be serious. I "," (know) him for ten years and I think he's a very agreeable person.'"],"solutions":[["has hated"],["started"],["have known"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: has hated. It's present perfect simple. It cannot be continuous because the verb 'hate' cannot be used in continuous tenses.","Corr: started. It's past simple because in a clause starting with 'since' we usually use past simple, referring to a point in the past.","Corr have known. It's present perfect simple. It cannot be continuous because the verb 'know' cannot be used in continuous tenses."]},{"id":1,"sentence":["Roland "," (run) for only two years, but he "," (run) two marathons."],"solutions":[["has been running"],["has run"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: has been running. It's present perfect continuous because this action is still in progress and no quantity is mentioned.","Corr: has run. It's present perfect simple. It cannot be continuous because we say how many times he has a run a marathon, so a quantity is mentioned."]},{"id":2,"sentence":["'I "," (understand) the derivative since Harry "," (explain) it to me.' 'Lucky you. I "," (take) lessons from a private tutor for half a year, but I still don't know it.'"],"solutions":[["have understood"],["explained"],["have been taking"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: It's present perfect simple. It cannot be continuous because the verb 'understand' cannot be used in continuous tenses.","Corr: explained. It's past simple because in a clause starting with 'since' we usually use past simple, referring to a point in the past.","Corr: have been taking. It's present perfect continuous because it's still in progress and no quantity is mentioned."]},{"id":3,"sentence":["'How much weight "," you "," (lose) since you "," (start) your slimming diet?' 'I "," (lose) six pounds in the last three months. That's not much. I "," (not eat) any fattening food for a long time now.'"],"solutions":[["have"],["lost"],["started"],["have lost"],["haven't eaten","have not eaten"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: have. It's present perfect simple because we're asking about a quantity (how much weight).","Corr: lost. It's present perfect simple because we're asking about a quantity (how much weight). We need the 3rd form of the verb here.","Corr: started. It's past simple because in the 'since' clause we usually use past simple when we refer to a past event.","Corr: have lost. It's present perfect simple because we mention a quantity (six pounds).","Corr: haven't eaten. It's present perfect simple because we mention a quantity (any fattening food)."]},{"id":4,"sentence":["We "," (travel) in Asia for three weeks now. We "," (visit) Thailand, Vietnam and China. Next week we're visiting Japan. I "," (want) to see this country since I "," (see) the series entitled Shogun in my childhood."],"solutions":[["have been travelling"],["have visited"],["have wanted"],["saw"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: have been travelling. It's present perfect continuous because this action is still in progress and no quantity is mentioned.","Corr: have visited. It's present perfect simple because this sentence is about closed down actions, they are not in progress any more.","Corr: have wanted. It's present perfect simple because the verb 'want' cannot be used in continuous tenses.","Corr: saw. It's past simple because in the 'since' clause we use past simple if we refer to a past event."]},{"id":5,"sentence":["We "," (hike) in these mountains since early morning and we "," (not stop) yet. We "," (not eat) anything since we "," (start), so I'm terribly hungry."],"solutions":[["have been hiking"],["haven't stopped","have not stopped"],["haven't eaten","have not eaten"],["started"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: have been hiking. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: haven't stopped. It's present perfect simple because it's not about how long we have been doing something. It's about an expected event that hasn't happened yet.'","Corr: haven't eaten. It's present perfect simple because of the quantity (anything).","Corr: started. It's past simple because in the 'since' clause we use past simple when we refer to a past event."]}]}