{"title":"Present Perfect Simple or Continuous - for, since - 1","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2, B1present perfect continuousB2 or B1past simpleB2.","weight":"3","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'How long "," you "," (play) tennis?' 'Since morning, and I "," (not lose) any matches.'"],"solutions":[["have"],["been playing"],["haven't lost","have not lost"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have. It's present perfect continuous. We ask with 'how long' and there's no quantity in the sentence.","Corr: been playing. It's present perfect continuous. We ask with 'how long' and there's no quantity in the sentence.","Corr: haven't lost. It's present perfect, but it can't be continuous because there's quantity in it (any matches)."]},{"id":1,"sentence":["'They "," (build) this metro line for 10 years, but they "," (finish) only six stations.' 'Yes. The previous city government "," (be) more successful, I think.'"],"solutions":[["have been building"],["have finished"],["were"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have been building. It's present perfect continuous because this action is still going on, and not quantity in the sentence.","Corr: have finished. It's present perfect, but it can't be continuous because we mention a quantity (only six stations).","Corr: were. It's past simple because it's about the 'previous' city government, so it's about a time period that closed down in the past."]},{"id":2,"sentence":["'My mum "," (cook) since morning because some relatives are going to visit us.' 'Do you like them?' 'I don't know. I "," (not meet) them for several years. Perhaps I "," (be) only 8 years old when I "," (last see) them.'"],"solutions":[["has been cooking"],["haven't met","have not met"],["was"],["last saw"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: has been cooking. It's pres. perfect continuous because it's still going on at the time of speaking and we don't mention quantity.","Corr: haven't met. The present perfect simple is more natural here. The continuous would be emotionally loaded.","Corr: was. It's past simple because it happened 'when I was 8 years old'.","Corr: last saw. It's past simple because there's a time adverb, a whole sentence (when I was 8 years old)."]},{"id":3,"sentence":["'How long "," your wife "," (shop) in the plaza?' 'She "," (shop) for three hours, but she "," (not buy) anything. So I'm happy because it means she "," (not spend) much money either.'"],"solutions":[["has"],["been shopping"],["has been shopping"],["hasn't bought"],["hasn't spent","has not spent"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: has. It's present perfect continuous because this action is still going on and no quantity is mentioned.","Corr: been shopping. It's present perfect continuous because this action is still going on and no quantity is mentioned.","Corr: has been shopping. It's present perfect continuous because this action is still going on and no quantity is mentioned.","Corr: hasn't bought. It's present perfect simple because we mention a quantity (anything).","Corr: hasn't spent. It's present perfect simple because we mention a quantity (much money)."]},{"id":4,"sentence":["'How long "," you "," (play) that computer game?' 'I "," (play) this for three months and so far I "," (collect) more than 3,000 points because I "," (kill) a lot of monsters.' 'I "," (play) a car racing game only for two weeks, so I'm not very good yet. I "," (be) to three races, but I "," (not win) any of them yet, but yesterday my car "," (come) in third.'"],"solutions":[["have"],["been playing"],["have been playing"],["have collected"],["have killed"],["have been playing"],["have been"],["haven't won","have not won"],["came"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: have. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: been playing. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: have been playing. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: have collected. It's present perfect simple because we mention a quantity (3,000 points).","Corr: have killed. It's present perfect simple because we mention a quantity (a lot of monsters).","Corr: have been playing. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: have been. It's present perfect simple because because the verb 'be' cannot be used in the continuous.","Corr: haven't won. It's present perfect simple because we mention a quantity (any of them).","Corr: came. It's past simple because of the time adverb 'yesterday'."]},{"id":5,"sentence":["'Sally "," (do) her slimming diet for a long time, but she "," (not lose) much weight, I'm afraid.' 'Yes, that's true. Maybe she "," (stop) the diet long time ago, but she "," (not tell) it to us.'"],"solutions":[["has been doing"],["hasn't lost","has not lost"],["stopped"],["hasn't told","has not told"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: has been doing. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: hasn't lost. It's present perfect simple because we mention a quantity (much weight).","Corr: stopped. It's past simple because of the time adverb 'long time ago'.","Corr: hasn't told. It's present perfect simple because we consider a time period that started in the past and continues up to now, since she stopped the diet up to the present."]}]}