{"title":"Present Perfect Simple or Continuous - for, since - 4","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2, B1present perfect continuousB2 or B1past simpleB2.","weight":"3","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["My husband "," (sit) in front of the TV since morning. He "," (not do) anything today."],"solutions":[["has been sitting"],["hasn't done","has not done"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: has been sitting. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: hasn't done. It's present perfect simple because we mention a qantity (anything)."]},{"id":1,"sentence":["We "," (do) a pub crawl with the guys for some hours and so far we "," (visit) three pubs. I "," (drink) six pints of beer."],"solutions":[["have been doing"],["have visited"],["have drunk"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have been doing. It's present perfect continuous because this action is still in progress and no quantity is mentioned.","Corr: have visited. It's present perfect simple because we mention a quantity (three pubs).","Corr: have drunk. It's present perfect simple because we mention a quantity (six pints)."]},{"id":2,"sentence":["'I "," (try) to catch Peter in his office for hours, but it's hopeless.' 'Yes, I know. I "," (phone) him three times since 9 o'clock, but I "," (reach) only his secretary.'"],"solutions":[["have been trying"],["have phoned"],["have reached"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have been trying. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: have phoned. It's present perfect simple. It cannot be continuous because we mention how many times we have done something.","Corr: have reached. It's present perfect simple because we speak about finished actions up to now."]},{"id":3,"sentence":["I "," (sell) my Suzuki Savage chopper ten years ago, and since then I "," (not have) a motorbike. I "," (have) to sell it because we "," (need) money for a new flat."],"solutions":[["sold"],["haven't had","have not had"],["had"],["needed"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: sold. It's past simple because of the time adverb 'ten years ago'.","Corr: haven't had. It's present perfect simple because the verb 'have' expressing possession cannot be used in the continuous.","Corr: had. It's past simple because the time adverb 'ten years ago' applies to this verb, too.","Corr: needed. It's past simple because the time adverb 'ten years ago' applies to this verb, too."]},{"id":4,"sentence":["'"," you "," (date) Gina long?' 'Luckily, not, only for two months. Then I "," (find) out she "," (have) a husband, and so we "," (break) up. Since then, I "," (not have) a girlfriend.'"],"solutions":[["Did"],["date"],["found"],["had"],["broke"],["haven't had","have not had"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Did. It's past simple because later we can find out from the story that the other person does not date Gina any more. So this is an action finished in the past.","Corr: date. It's past simple because later we can find out from the story that the other person does not date Gina any more. So this is an action finished in the past.","Corr: found. It's past simple because we can know that it happened before the end of the relationship.","Corr: had. It's past simple because we know that it was true at the end of the relationship.","Corr: broke. It's past simple because we that it happened after he found out about the husband.","Corr: haven't had. It's present perfect simple because it's still true in the present and we think of a period of time starting in the past. It cannot be continuous because 'have' cannot be used in the continuous when it expresses possession."]}]}