{"title":"Present Perfect Simple or Continuous - for, since - 3","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2, B1present perfect continuousB2 or B1past simpleB2.","weight":"3","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["We "," (travel) to Planet Terminus for three months now. We should have arrived earlier, but our spaceship "," (break) down twice so far."],"solutions":[["have been travelling"],["has broken"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: have been travelling. It's present perfect continuous because it's still in progress.","Corr: has broken. It's present perfect simple because we say how many times it has happened."]},{"id":1,"sentence":["'How long "," you "," (learn) French?' 'Only for 4 months. I "," (stop) it because it "," (not be) necessary in my new job. But there I "," (begin) to learn German and since then I "," (take) and "," (pass) an intermediate exam.'"],"solutions":[["did"],["learn"],["stopped"],["was not","wasn't"],["began"],["have taken"],["have passed","passed"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: did. It's past simple because this question is about a period that started and finished in the past.","Corr: learn. It's past simple because this question is about a period that started and finished in the past.","Corr: stopped. It's past simple because it was at the end of that four month period.","Corr: wasn't necessary. It's past simple because it was when the speaker started the new job.","Corr: began. It's past simple because it was when the speaker started the new job.","Corr: have taken. It's present perfect simple. It cannot be continuous because the speaker mentions a quantity (an intermediate exam).","Corr: (have) passed. It's present perfect simple. It cannot be continuous because the speaker mentions a quantity (an intermediate exam)."]},{"id":2,"sentence":["We "," (come) to this spa bath for five years. We love it. Last year we "," (come) here only once, but this year we "," (be) here a hundred  times."],"solutions":[["have been coming"],["came"],["have been"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have been coming. It's present perfect continuous because this action is still in progress and no quantity is mentioned.","Corr: came. It's past simple because of the time adverb 'last year'.","Corr: have been. It's present perfect simple. It's about an unfinished time period (this year, that is, since the beginning of this year), but it cannot be continuous because we say 'how many times we have done this'."]},{"id":3,"sentence":["I "," (get) this bar of chocolate only a minute ago, but I "," (eat) almost the whole bar. I "," (not eat) sweets since I "," (decide) to change my lifestyle, so perhaps that's why I crave it so much."],"solutions":[["got"],["have eaten"],["haven't eaten","have not eaten"],["decided"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: got. It's past simple because of the adverb 'a minute ago'.","Corr: have eaten. It's present perfect because it's about a time period starting when he got the chocolate, and lasting until now. It cannot be continuous because we mention a quantity (the whole bar).","Corr: haven't eaten or haven't been eating. Both present perfect simple or continuous are acceptable. The continuous is emotionally loaded.","Corr: decided. It's past simple because in the 'since' clause we use past simple when we refer to a past event."]},{"id":4,"sentence":["Lola "," (play) the violin since she "," (be) five. She "," (prepare) for a concert for three months now. She's very excited because she "," (never give) a concert in her life."],"solutions":[["has been playing"],["was"],["has been preparing"],["has never given"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: has been playing. It's present perfect continuous because it's still in progress and no quantity is mentioned.","Corr: was. It's past simple because it's in  the 'since' clause.","Corr: has been preparing. It's present perfect continuous because this action is still in progress.","Corr: has never given. It's present perfect simple because it's about whether she has done something in her life or not."]},{"id":5,"sentence":["Since these aliens "," (appear) in my life, a lot of strange things "," (happen) to me. There's a spaceship that "," (follow) me for three weeks, and some of our family members "," (disappear), too."],"solutions":[["appeared"],["have happened"],["has been following"],["have disappeared"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: appeared. It's past simple because it's in a 'since' clause.","Corr: have disappeared. It's present perfect simple because we mention a quantity (a lot of strange things).","Corr: has been following. It's present perfect continuous because it's still in progress, an no quantity is mentioned.","Corr: have disappeared. It's present perfect simple because we mention a quantity (some of our family members)."]}]}