{"title":"Past Simple or Past Perfect - 3","instructions":"Complete the sentences with the verbs. Use B1past simpleB2 or B1past perfectB2.","weight":"2","exa":null,"type":"0","helps":[""],"contents":[{"id":0,"sentence":["I "," my present wife only for a year when I "," to her."],"solutions":["GGG","GGG"],"distractors":[["knew","had known"],["proposed","had proposed"]],"solu":["1-0"],"remarks":[["Corr: had known. It's past perfect because we speak about a period of time (for a year) before a past moment."],["Corr: proposed. It's past simple because it didn't happen before anything."]]},{"id":1,"sentence":["Unfortunately, the guests "," all the sandwiches by the time I "," at the party."],"solutions":["GGG","GGG"],"distractors":[["ate","had eaten"],["arrived","had arrived"]],"solu":["1-0"],"remarks":[["Corr: had eaten. It's past perfect because this action had happened earlier than the action in the 'by the time' part."],["Corr: arrived. It's past simple because it's in the 'by the time' part of the sentence. It's a time adverb."]]},{"id":2,"sentence":["I almost "," asleep at the meeting because I "," any coffies before."],"solutions":["GGG","GGG"],"distractors":[["fell","had fallen"],["didn't drink","hadn't drunk"]],"solu":["0-1"],"remarks":[["Corr: fell. It's past simple because it happened later than the action in the next clause."],["Corr: hadn't drunk. It's past perfect because it had happened before the action in the previous clause."]]},{"id":3,"sentence":["I "," at work, I "," on my computer, but I "," it wouldn't boot. Perhaps someone "," tampered with it."],"solutions":["GGG","GGG","GGG","GGG"],"distractors":[["arrived","had arrived"],["switched","had swithced"],["saw","had seen"],["tampered","had tampered"]],"solu":["0-0-0-1"],"remarks":[["Corr: arrived. It's past simple because this is where the story starts."],["Corr: switched. It's past simple because it happend after the previous action."],["Corr: saw. It's past simple because it happened after the previous action."],["Corr: had tampered. It's past perfect because it had happened before all the previous actions."]]},{"id":4,"sentence":["I "," very sorry that I "," that watch. I "," to my heart."],"solutions":["GGG","GGG","GGG"],"distractors":[["was","had been"],["lost","had lost"],["grew","had grown"]],"solu":["0-1-1"],"remarks":[["Corr: was. It's past simple because the story starts here, it didn't happen before anything."],["Corr: had lost. It's past perfect because it had happened earlier, that is, before the speaker was sorry."],["Corr: had grown. It's past perfect because it had happened before the speaker was sorry."]]},{"id":5,"sentence":["When it "," to rain, I "," very angry. I "," wet through because I "," to put my umbrella in my bag."],"solutions":["GGG","GGG","GGG","GGG"],"distractors":[["started","had started"],["became","had become"],["got","had got"],["forgot","had forgotten"]],"solu":["0-0-0-1"],"remarks":[["Corr: started. It's past simple because the story starts here."],["Corr: became. It's past simple because it happened after the previous action."],["Corr: got. It's past simple because it happened after the previous action."],["Corr: had forgotten. It's past perfect because it had happened before all the actions in the previous clauses."]]},{"id":6,"sentence":["When I "," home, I "," very happy to see that my wife "," the dinner and "," the table, too."],"solutions":["GGG","GGG","GGG","GGG"],"distractors":[["arrived","had arrived"],["was","had been"],["cooked","had cooked"],["laid","had laid"]],"solu":["0-0-1-1"],"remarks":[["Corr: arrived. It's past simple because the story starts here."],["Corr: was. It's past simple because happened after the previous action."],["Corr: had cooked. It's past perfect because it had happened before the previous action."],["Corr: had laid. It's past perfect because this action had started before the past simply signifying the beginning of the story."]]},{"id":7,"sentence":["Yesterday I "," back from my holidays and "," to work, but my colleagues "," any of my work, so I "," very angry."],"solutions":["GGG","GGG","GGG","GGG"],"distractors":[["got","had got"],["started","had started"],["didn't do","hadn't done"],["was","had been"]],"solu":["0-0-1-0"],"remarks":[["Corr: got. It's past simple because the story starts here."],["Corr: started. It's past simple because this action happened after the previous action."],["Corr: hadn't done. It's past perfect because this action had happened before the speaker 'got back' from holidays."],["Corr: was. It's past simple because ths action happened after the previous actions."]]}]}