{"title":"Past Simple or Past Continuous 2","instructions":"Complete the sentences with the verbs. Use B1past simpleB2 or B1past continuousB2.","weight":"2","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["We "," (have) dinner when somebody "," (ring) the bell. I "," (open) the door and there was a small man. He "," (look) for his cat."],"solutions":[["were having"],["rang"],["opened"],["was looking"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: were having. It's past continuous because this action was in progress when 'somebody rang the bell'.","Corr: rang. It's past simple because this action was not interrupted by anything and we can see it as a whole.","Corr: opened. It's past simple because this action was not interrupted by anything and we can see it as a whole.","Corr: was looking. It's past continuous because this action was in progress when 'I opened the door'."]},{"id":1,"sentence":["I "," (want) to drink a shot with my neighbour, so I "," (shout) to him, but he "," (not hear) it because he "," (cut) the grass."],"solutions":[["wanted"],["shouted"],["didn't hear","did not hear"],["was cutting"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: wanted. It's past simple because it can be seen as a whole. It was not interrupted by anything.","Corr: shouted. It's past simple because it can be seen as a whole. It was not interrupted by anything.","Corr: didn't hear. It's past simple because it can be seen as a whole. It was not interrupted by anything and the verb 'hear' is not used in continuous tenses.","Corr: was cutting. It's past continuous because it was in progress when the speaker 'shouted to' his neighbour."]},{"id":2,"sentence":["Bob "," (take) his dog out for a walk in the park when it "," (start) to rain. He "," (go) home quickly, even if the dog "," (not want)."],"solutions":[["was taking"],["started"],["went"],["didn't want","did not want"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: was taking. It's past continuous because it was in progress 'when it started to rain'.","Corr: started. It's past simple because it was just the work of a moment and was not interrupted by anything.","Corr: went. It's past simple because it was not interrupted by anything and we think of this action as a whole. We can see its beginning and end.","Corr: didn't want. It's past simple because it was not interrupted by anything and the verb 'want' cannot be used in the continuous."]},{"id":3,"sentence":["'How "," you "," (break) your leg?' 'I "," (fall) down while I "," (ski) in the Alps.'"],"solutions":[["did"],["break"],["fell"],["was skiing"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: did. It's past simple because the speaker see it as a whole, this action started and finished and was not interrupted by anything.","Corr: It's past simple because the speaker see it as a whole, this action started and finished and was not interrupted by anything.","Corr: fell. It's past simple because the speaker see it as a whole, this action started and finished and was not interrupted by anything.","Corr: was skiing. It's past continuous because this action was in progress when the speaker 'fell down'."]},{"id":4,"sentence":["My wife "," (look) at me angrily when she "," (see) that I "," (eat) chips. You know, I "," (do) a slimming diet - theoretically."],"solutions":[["looked"],["saw"],["was eating"],["was doing"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: looked. It's past simple because it was not interrupted by any other action.","Corr: saw. It's past simple because it was not interrupted by any other action.","Corr: was eating. It's past continuous because it was interrupted by the actions mentioned in the previous clauses.","Corr: was doing. It's past continuous because this action was in progress at the time of speaking."]},{"id":5,"sentence":["I "," (break) off a know from the photocopy machine, but as nobody "," (watch), I "," (not say) anything. I "," (just go) back to my desk as if nothing had happened."],"solutions":[["broke"],["was watching"],["didn't say","did not say"],["just went"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: broke. It's past simple because it was not interrupted by any other action.","Corr: was watching. It's past continuous because this action was in progress when he 'broke off the knob'.","Corr: didn't say. It's past simple because it was not interrupted by any other action.","Corr: just went. It's past simple because it was not interrupted by any other action."]},{"id":6,"sentence":["'What "," you "," (do) at 2 am?' 'I "," (sleep), of course.'"],"solutions":[["were"],["doing"],["was sleeping"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: were. It's past continuous because the speaker thinks it was in progress at given point in the past (at 2 am).","Corr: doing. It's past continuous because the speaker thinks it was in progress at given point in the past (at 2 am).","Corr: was sleeping. It's past continuous because it was in progress at given point in the past (at 2 am)."]},{"id":7,"sentence":["'So, you "," (arrive) home at 7. And what "," you "," (do) after that?' 'Well, I "," (watch) a film on TV.'"],"solutions":[["arrived"],["did"],["do"],["watched"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: arrived. It's past simple because we see this action as a whole, nothing interrupted it.","Corr: did. It's past simple because the speaker thinks that this action was not interrupted by any other actions.","Corr: do. It's past simple because the speaker thinks that this action was not interrupted by any other actions.","Corr: watched. It's past simple because it was not interrupted by anything else. We can see it as a whole."]}]}