{"title":"Past Simple or Past Continuous 4","instructions":"Complete the sentences with the verbs. Use B1past simpleB2 or B1past continuousB2.","weight":"2","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["I "," (change) my clothes in my bedroom when the neighbour's daughter "," (come) in. She "," (scream) and "," (run) away. The next moment her father "," (look) in the room and he "," (see) me as I "," (stand) there with only my boxers on."],"solutions":[["was changing"],["came"],["screamed"],["ran"],["looked"],["saw"],["was standing"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: was changing. It's past continuous because it was in progress when the girl 'came in'.","Corr: came. It's past simple because it was not interrupted by anything.","Corr: screamed. It's past simple because it just followed the previous action, it was not interrupted by anything else.","Corr: ran. It's past simple because it just followed the previous action, it was not interrupted by anything else.","Corr: looked. It's past simple because it just followed the previous action, it was not interrupted by anything else.","Corr: saw. It's past simple because it just followed the previous action, it was not interrupted by anything else.","Corr: was standing. It's past continuous because it was in progress when the father 'looked' in the room."]},{"id":1,"sentence":["Our boss "," (give) a presentation in the meeting room, and "," (talk) about the new project when the lights "," (go) out. We "," (think) we could leave, but she "," (continue) her talk. She "," (read) out her notes."],"solutions":[["was giving"],["was talking"],["went"],["thought"],["continued"],["read"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: was giving. It's past continuous because this action was in progress when the 'lights went out'.","Corr: (was) talking. It's past continuous because this action was in progress when the 'lights went out'.","Corr went. It's past simple because it was not interrupted by anything.","Corr thought. It's past simple because it was not interrupted by anything. It followed the previous action.","Corr continued. It's past simple because it was not interrupted by anything. It followed the previous action.","Corr read. It's past simple because it was not interrupted by anything. It followed the previous action."]},{"id":2,"sentence":["I "," (be) half an hour late for work, so when I "," (enter) the office, who "," (stand) at my desk? My boss! He "," (not become) angry, he "," (just give) me a lot of work to do."],"solutions":[["was"],["entered"],["was standing"],["didn't become","did not become"],["just gave"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: was. It's past simple. We cannot use the verb 'be' in continuous tenses.","Corr: entered. It's past simple because this action was not interrupted by anything.","Corr: was standing. It's past continuous because this was in progress when 'I entered'.","Corr: didn't become. It's past simple because this action was not interrupted by any other action, it just followed the previous action.","Corr: just gave. It's past simple because this action was not interrupted by any other action, it just followed the previous action."]},{"id":3,"sentence":["George "," (not hear) when we "," (ring) the bell because he "," (listen) to music on his headphones. We "," (phone) him on his mobile, too, but he "," (not answer). So we "," (leave)."],"solutions":[["didn't hear","did not hear"],["rang"],["was listening"],["phoned"],["didn't answer","did not answer"],["left"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: didn't hear. It's past simple because we cannot use the verb 'hear' in continuous tenses.","Corr: rang. It's past simple because this action was not interrupted by anything else.","Corr: was listening. It's past continuous because this action was in progress when 'we rang the bell'.","Corr: phoned. It's past simple because this action just followed the previous action and was not interrupted by anything else.","Corr: didn't answer. It's past simple because this action just followed the previous action and was not interrupted by anything else.","Corr: left. It's past simple because this action just followed the previous action and was not interrupted by anything else."]},{"id":4,"sentence":["I "," (be) drunk. I "," (lie) on the ground totally helpless. The people "," (come) and "," (go) without looking at me. It "," (rain), so I "," (try) to collect my strength to stand up."],"solutions":[["was"],["was lying"],["were coming"],["were going"],["was raining"],["tried"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: was. It's past simple because we cannot use the verb 'be' in the continuous.","Corr: was lying. It's past continuous because this action was in progress at that time. It is interrupted by the action: 'I tired to...' in the last clause.","Corr: were coming. It's past continuous because this action was in progress at that time. It is interrupted by the action: 'I tired to...' in the last clause.","Corr: (were) going. It's past continuous because this action was in progress at that time. It is interrupted by the action: 'I tired to...' in the last clause.","Corr: was raining. It's past continuous because this action was in progress at that time. It is interrupted by the action: 'I tired to...' in the last clause.","Corr: tried. It's past simple because it was not interrupted any other actions. It interrupted all the other actions in progress said in the previous clauses."]},{"id":5,"sentence":["I "," (walk) home and when I "," (turn) round the corner, I "," (see) that my best friend, Bob, "," (leave) our house. I "," (know) that my wife "," (be) at home, but I "," (not know) that she'd invited him."],"solutions":[["was walking"],["turned"],["saw"],["was leaving"],["knew"],["was"],["didn't know","did not know"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: was walking. It's past continuous because this action was in progress.","Corr: turned. It's past simple because it was not interrupted by anything.","Corr: saw. It's past simple because the verb 'see' is not used in the continuous.","Corr: was leaving. It's past continuous because this action was just happening when I saw it.","Corr: knew. It's past simple because the verb 'know' cannot be used in the continuous.","Corr: was. It's past simple because the verb 'be' cannot be used in the continuous.","Corr: didn't know. It's past simple because the verb 'know' cannot be used in the continuous."]}]}