{"title":"Past Simple or Past Continuous 1","instructions":"Complete the sentences with the verbs. Use B1past simpleB2 or B1past continuousB2.","weight":"2","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["We "," (walk) home through the park when it "," (start) to rain."],"solutions":[["were walking"],["started"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: were walking. It's past continuous because it was in progress when it started to rain.","Corr: started. The other action, the walking was in progress when it happened, so it is past simple."]},{"id":1,"sentence":["When I "," (arrive) home, my wife "," (cook) dinner."],"solutions":[["arrived"],["was cooking","cooked"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: arrived. It's past simple because it was just a moment, and no other action interrupted it.","Corr: was cooking or cooked. If the cooking was in progress when 'I arrived home', the continuous form is correct. If we want to express  that the cooking started after 'I arrived home', the past simple form is correct."]},{"id":2,"sentence":["I "," (not pick) up the phone because I "," (drive) when you "," (call) me."],"solutions":[["didn't pick","did not pick"],["was driving"],["called"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: didn't pick. It's past simple because nothing interrupts this action.","Corr: was driving. It's past continuous because it was in progress when the call happened.","Corr: called. It's past simple because it interrupted the driving."]},{"id":3,"sentence":["I "," (wait) for the bus when a man "," (come) up to me and "," (ask) me for some money."],"solutions":[["was waiting"],["came"],["asked"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: was waiting. It's continuous because this action was in progress when the 'man came up to me'.","Corr: came. It's past simple because we see this action as whole: it started and finished and it was not interrupted by anything.","Corr: asked. It's past simple because we see this action as whole: it started and finished and it was not interrupted by anything."]},{"id":4,"sentence":["I "," (go) into the kids' room, but they "," (play) with their favourite toy, so I "," (not say) anything. I just "," (leave) the room silently."],"solutions":[["went"],["were playing"],["didn't say","did not say"],["left"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: went. It's past simple because we see this action as a whole.","Corr: were playing. It's past continuous because it was in progress when 'I went into the room'.","Corr: didn't say. It's past simple because we can see it as a whole. It was not interrupted by anything.","Corr: left. It's past simple because we can see it as a whole. It was not interrupted by anything."]},{"id":5,"sentence":["I "," (still sleep) when you "," (phone) me. That's why I "," (not answer) your call."],"solutions":[["was still sleeping"],["phoned"],["didn't answer","did not answer"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: was still sleeping. It's past continuous because it was in progress when 'you phoned me'.","Corr: phoned. It's past simple because we can see it as a whole. It was not interrupted by anything.","Corr: didn't answer. It's past simple because we can see it as a whole. It was not interrupted by anything."]},{"id":6,"sentence":["I "," (be) so tired last night that I "," (fall) asleep while we "," (watch) TV."],"solutions":[["was"],["fell"],["were watching"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: was. It's past simple because the verb 'be' is not used in continuous tenses.","Corr: fell. It's past simple because it was just the work of a moment and so we can see it as a whole. It interrupted the watching.","Corr: were watching. It's past continuous because it was in progress when it was interrupted by the action of falling asleep."]},{"id":7,"sentence":["'What "," they "," (do) when you "," (get) home?' 'Well, it was very late, so everyone "," (sleep).'"],"solutions":[["were"],["doing"],["got"],["was sleeping"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: were. It's past continuous because the question is about the actions that were in progress at the time of the other person's arriving home.","Corr: doing. It's past continuous because the question is about the actions that were in progress at the time of the other person's arriving home.","Corr: got. It's past simple because it was not interrupted by anything. We see it as a whole.","Corr: was sleeping. It's past continuous because this action was in progress when the speaker arrived home."]}]}