{"title":"Past Simple or Past Continuous 3","instructions":"Complete the sentences with the verbs. Use B1past simpleB2 or B1past continuousB2.","weight":"2","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["Tracy "," (kiss) with her boyfriend on her sofa in her room when her mother "," (open) the door."],"solutions":[["was kissing"],["opened"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: was kissing. It's past continuous because this action was in progress and was interrupted when the mother opened the door.","Corr: opened. It's past simple because this action was not interrupted by any other actions."]},{"id":1,"sentence":["We "," (watch) TV when we "," (hear) some noise from the kitchen. I "," (go) there and I "," (see) that the cat "," (play) with a dead mouse."],"solutions":[["were watching"],["heard"],["went"],["saw"],["was playing"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: were watching. It's past continuous because this action was in progress when the action in the next clause happened.","Corr: heard. It's past simple. The verb 'hear' cannot be used in the continuous.","Corr: went. It's past simple because this action was not interrupted by anything else.","Corr: saw. It's past simple because this action was not interrupted by anything else.","Corr: was playing. It's past continuous because this action was in progress when 'I saw that the cat...'."]},{"id":2,"sentence":["Sue "," (try) to open the door of her flat when a man "," (go) up to her to help her. However, she "," (get) scared and "," (scream)."],"solutions":[["was trying"],["went"],["got"],["screamed"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: was trying. It's past continuous because this action was in progress when the 'man went up to her'.","Corr: went. It's past simple because this action was not interrupted by anything else.","Corr: got. It's past simple because this action was not interrupted by anything else. It followed the previous action.","Corr: screamed. It's past simple because this action was not interrupted by anything else."]},{"id":3,"sentence":["'What "," you "," (do) when you "," (finish) packing your suitcases?' 'I "," (think) about going to the railway station when my phone "," (ring). It was my wife. She "," (ask) me not to leave her.'"],"solutions":[["did"],["do"],["finished"],["was thinking"],["rang"],["asked"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: did. It's past simple because the speaker asks about the next action the other person did after 'he finished packing'.","Corr: do. It's past simple because the speaker asks about the next action the other person did after 'he finished packing'.","Corr: finished. It's past simple because this action was not interrupted by anything else.","Corr: was thinking. It's past continuous because this action was in progress 'when his phone rang'.","Corr: rang. It's past simple because it was not interrupted by anything else.","Corr: asked. It's past simple because it was not interrupted by any other action. We look at this action as a whole."]},{"id":4,"sentence":["I "," (look) around carefully and "," (realise) that nobody "," (watch). So I "," (put) the money in my pocket and "," (leave) the room silently."],"solutions":[["looked"],["realised"],["was watching"],["put"],["left"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: looked. It's past simple because it was not interrupted by anything else.","Corr: realised. It's past simple because it was not interrupted by anything else.","Corr: was watching. It's past continuous because this was happening at that moment, it started before 'I looked around'.","Corr: put. It's past simple because it was not interrupted by anything else.","Corr: left. It's past simple because it was not interrupted by anything else, it just followed the previous action."]},{"id":5,"sentence":["When I was young, I "," (live) in the country. Only after I "," (turn) forty did we move London."],"solutions":[["lived"],["turned"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: lived. It's past simple because it was not interrupted by anything.","Corr: turned. It's past simple because it was not interrupted by anything."]},{"id":6,"sentence":["When I "," (leave) home, it "," (rain). However, when I "," (arrive) at work, it "," (shine)."],"solutions":[["left"],["was raining"],["arrived"],["was shining"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: left. It's past simple because it was not interrupted by any other action.","Corr: was raining. It's past continuous because this action was in progress, it started before 'I left home'.","Corr: arrived. It's past simple because it was not interrupted by any other action.","Corr: was shining. It's past continuous because this action was in progress, it started before 'I arrived at work'."]},{"id":7,"sentence":["We "," (walk) in the city when two tourists "," (stop) us. They "," (ask) us for some directions. They "," (look) for the Basilica."],"solutions":[["were walking"],["stopped"],["asked"],["were looking"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: were walking. It's past continuous because this action was in progress when the 'two tourists stopped us'.","Corr: stopped. It's past simple because this action was not interrupted by anything else.","Corr: asked. It's past simple because this action was not interrupted by anything else.","Corr: were looking. It's past continuous because it was in progress, the tourists started looking for the Basilica before they 'stopped us'."]}]}