{"title":"Past Simple or Past Continuous","uid":null,"instructions":"Complete the sentences with the verbs. Use past simple or past continuous.","type":0,"contents":[{"id":0,"sentence":["We "," TV when the neighbours "," round."],"solutions":["GGG","GGG"],"distractors":[["watched ","were watching"],["came ","were coming"]],"solu":["1-0"],"remarks":[["Corr: were watching. This action was in progress when the neighbours came. ","C"],["C ","Corr: came. We can 'see' this action from its beginning to the end."]]},{"id":1,"sentence":["Sue "," a shower when I ","."],"solutions":["GGG","GGG"],"distractors":[["had ","was having"],["arrived ","was arriving"]],"solu":["1-0"],"remarks":[["Corr: was having. This action was in progress when I arrived. ","C"],["C ","Corr: arrived. We can see this action from the beginning to the end, so we don't need the continuous."]]},{"id":2,"sentence":["I "," up and "," down to the kitchen. My husband "," a newspaper and "," breakfast."],"solutions":["GGG","GGG","GGG","GGG"],"distractors":[["got ","was getting"],["went ","was going"],["read ","was reading"],["had ","was having"]],"solu":["0-0-1-1"],"remarks":[["C ","Corr: got. We can see this action from its beginning to the end, so we don't need the continuous."],["C ","Corr: went. We can see this action from its beginning to the end, so we don't need the continuous."],["Corr: was reading. This action was in progress when we entered the kitchen. ","C"],["Corr: was having. This action was in progress when we entered the kitchen. ","C"]]},{"id":3,"sentence":[""," a bath when I "," you? Is that why you "," the phone?"],"solutions":["GGG","GGG","GGG"],"distractors":[["Did you have ","Were you having"],["phoned ","was phoning"],["didn't pick up ","wasn't picking up"]],"solu":["1-0-0"],"remarks":[["Corr: Were you having. This action was in progress when I phoned. ","C"],["C ","Corr: phoned. We can see this action from the beginning to the end."],["C ","Corr: didn't pick up. We don't need continuous here because this action was not in progress."]]},{"id":4,"sentence":["There were two men in the other room, but I "," what they ","about."],"solutions":["GGG","GGG"],"distractors":[["didn't hear ","wasn't hearing"],["talked ","were talking"]],"solu":["0-1"],"remarks":[["C ","Corr: didn't hear. The verb 'hear' is not used in continuous tenses."],["Corr: were talking. This action, the talking, was in progress when we heard it. ","C"]]},{"id":5,"sentence":["'What "," they "," when you "," home?' 'They "," on the light and "," singing Happy birthday'."],"solutions":["GGG","GGG","GGG","GGG","GGG"],"distractors":[["did ","were"],["do ","doing"],["arrived ","were arriving"],["turned ","were turning"],["started ","were starting"]],"solu":["0-0-0-0-0"],"remarks":[["C ","Corr: did. Past simple is correct because this action was not in progress when something else happened. It happened afterwards."],["C ","Corr: do. Past simple is correct because this action was not in progress when something else happened. It happened afterwards."],["C ","Corr: arrived. Past simple is correct because this action was not in progress when something else happened. It happened afterwards."],["C ","Corr: turned. Past simple is correct because this action was not in progress when something else happened. It happened afterwards."],["C ","Corr: started. Past simple is correct because this action was not in progress when something else happened. It happened afterwards."]]},{"id":6,"sentence":["When I "," the room, she "," a gun in her hand. It ",". Her husband, George, "," on the floor."],"solutions":["GGG","GGG","GGG","GGG"],"distractors":[["entered ","was entering"],["held ","was holding"],["smoked ","was smoking"],["lay ","was lying"]],"solu":["0-1-1-1"],"remarks":[["C ","Corr: entered. This action was not in progress, we can see it from its beginning to the end."],["Corr: was holding. We need continuous here because it was already in progress when we entered the room. ","C"],["Corr: was smoking. We need continuous here because it was already in progress when we entered the room. ","C"],["Corr: was lying. We need continuous here because it was already in progress when we entered the room. ","C"]]},{"id":7,"sentence":["When our car "," out of fuel, it "," and we all "," home on foot. It wasn’t a very pleasant thing because it "," ."],"solutions":["GGG","GGG","GGG","GGG"],"distractors":[["ran ","was running"],["stopped ","was stopping"],["went ","were going"],["rained ","was raining"]],"solu":["0-0-0-1"],"remarks":[["C ","Corr: ran. This action started and finished. It was not in progress."],["C ","Corr: stopped. This action was not in progress. It happned after the car ran out of fuel."],["C ","Corr: went. We can see this action from the beginning to the end."],["Corr: was raining. We need the continuous because this action was in progress while all the others happened. ","C"]]}]}