{"title":"Present Perfect - already, yet - 4","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'So you "," (start) writing this essay yesterday and you "," (already finish) it?' 'No, you misunderstood me. I "," (not even start) it yet. I "," (not write) a line yet.'"],"solutions":[["started"],["have already finished"],["haven't even started","have not even started"],["haven't written","have not written."]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: started. It's past simple because of the time adverb 'yesterday'.","Corr: have already finished. It's present perfect because the speaker wants to express some surprise that the other person has finished the essay earlier than expected.","Corr: haven't even started. It's present perfect because it's about an action that the speaker has not started yet and it's unexpected.","Corr: haven't written. It's present perfect because it's something the speaker has not done up to now."]},{"id":1,"sentence":["'So your wife is really leaving you?' 'Yes, she "," (already pack) her suitcases.' 'I see, but maybe she "," (not call) a taxi yet.' 'No, she "," . But I "," (ask) a friend to take her away.'"],"solutions":[["has already packed"],["has not called","hasn't called"],["hasn't"],["have asked"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: has already packed. It's present perfect because this action happened earlier than expected.","Corr: hasn't called. It's present perfect because this action has not happened up to now.","Corr: hasn't. It's a short answer to the previous sentence.","Corr: have asked. It's present perfect because there's no time adverb and we could put in 'already'."]},{"id":2,"sentence":["'"," the teacher "," (correct) your test papers yet?' 'I don't know. We "," (not get) them back yet. But don't worry. We "," (write) this test only three days ago.'"],"solutions":[["Has"],["corrected"],["haven't got","have not got"],["wrote"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Has. It's present perfect because the speaker asks about an action that he or she expects to have happened.","Corr: corrected. It's present perfect because the speaker asks about an action that he or she expects to have happened.","Corr: haven't got. It's present perfect because it is about an action that has not happened up to now.","Corr: wrote. It's past simple because of the time adverb 'three days ago'."]},{"id":3,"sentence":["I "," (rob) a bank a few days ago and I "," (already buy) a lot of stupid things. However, I "," (not get) rid of the gun yet. But no rush. The police "," (not find) any traces yet."],"solutions":[["robbed"],["have already bought"],["haven't got","have not got"],["haven't found","have not found"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: robbed. It's past simple because of the time adverb 'a few days ago'.","Corr: have already bought. It's present perfect because it expresses that the speaker did something earlier than expected.","Corr: haven't got. It's present perfect because it says that the speaker has not done something up to now.","Corr: haven't found. It's present perfect because this action has not happened up to the present moment and it's unexpected."]},{"id":4,"sentence":["'"," I "," (introduce) you to our new colleague, Bob?' 'No, you "," . Our boss "," (tell) me at the team building party that he'd like to take on a new worker, but I "," (not see) the new guy.'"],"solutions":[["Have"],["introduced"],["haven't"],["told"],["haven't seen","have not seen"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because it asks about whether an action has happened up to now or not. We could put 'yet' to end of the sentence.","Corr: introduced. It's present perfect because it asks about whether an action has happened up to now or not. We could put 'yet' to end of the sentence.","Corr: haven't. It's a short answer to a question in present perfect.","Corr: told. It's past simple because we refer to a past event, the 'team building party'. The party started and ended in the past.","Corr: haven't seen. It's present perfect because it's about a time period up to now and it's unexpected that the speaker has not seen the new guy."]},{"id":5,"sentence":["Todd "," (arrive) at our party only ten minutes ago, but he "," (already drink) five beers. However, he "," (not dance) with any of the girls yet. I don't like him. I don't know why I "," (invite) him here."],"solutions":[["arrived"],["has already drunk"],["hasn't danced","has not danced"],["invited"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: arrived. It's past simple because of the time adverb 'ten minutes ago'.","Corr: has already drunk. It's present perfect because it's about a period of time up to now and it's unexpected that Todd has drunk so much beer.","Corr: hasn't danced. It's present perfect because it's about a time period up to now.","Corr: invited. It's past simple because the action, the invitation is connected to the past, and it's not connected to the present."]}]}