{"title":"Present Perfect - already, yet - 1","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'"," you "," (find) the key yet?' 'Yes, I "," . It "," (be) under the door mat.'"],"solutions":[["Have"],["found"],["have"],["was"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because the question is about whether an action has happened up to now or not.","Corr: found. It's present perfect because the question is about whether an action has happened up to now or not.","Corr: have. It's present perfect. It's a short answer to a question in present perfect.","Corr: was. It's past simple because the key is not there any more."]},{"id":1,"sentence":["'When "," you "," (meet) Judy, our new boss?' 'Well, actually, I "," (not meet) her yet. Why?' 'I "," (already meet) her, but I don't like her.'"],"solutions":[["did"],["meet"],["haven't met","have not met"],["have already met"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: did. It's past simple because the questions starts with 'When', so we're asking about a concrete, specific time point in the past, not about a period of time coming up to the present moment.","Corr: meet. It's past simple because the questions starts with 'When', so we're asking about a concrete, specific time point in the past, not about a period of time coming up to the present moment.","Corr: haven't met. It's present perfect because it's still true in the present and it's about a time period that comes up to now.","Corr: have already met. It's present perfect because it expresses that something has happened before it was expectable."]},{"id":2,"sentence":["'"," they "," (deliver) the new furniture yet?' 'No, they "," . I "," (order) it two weeks ago, so it can arrive at any time now.'"],"solutions":[["Have"],["delivered"],["haven't"],["ordered"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because we're asking whether an action has happened up to now, an action that is expectable to have happened.","Corr: delivered. It's present perfect because we're asking whether an action has happened up to now, an action that is expectable to have happened.","Corr: haven't. It's a short answer to a question in present perfect. In short answers only the contracted form is acceptable.","Corr: ordered. It's past simple because of the time adverb 'two weeks ago.'"]},{"id":3,"sentence":["'"," you "," (sell) your car yet?' 'No, I "," . I "," (already put) in an ad and I "," (already talk) to two potential buyers.' 'And? Is one of them going to buy your car?' 'I don't know. Both of them "," (promise) to call me back, but neither of them "," (phone) me yet.'"],"solutions":[["Have"],["sold"],["haven't"],["have already put"],["have already talked"],["promised"],["has phoned","have phoned"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because we're asking whether an action has happened up to now, an action that we can expect to have happened.","Corr: sold. It's present perfect because we're asking whether an action has happened up to now, an action that we can expect to have happened.","Corr: haven't. It's present perfect because it's a short answer to a question in present perfect.","Corr: have already put. It's present perfect because the speaker wants to express that he has done something a bit earlier than expected.","Corr: have already talked. It's present perfect because the speaker wants to express that he has done something a bit earlier than expected.","Corr: promised. It's past simple because here the speaker is speaking about an event (promise to call back) that connects to the past. It's not about a time period that comes up to now. It happened 'then'.","Corr: has phoned. It's present perfect because it's about a time period that comes up to now."]},{"id":4,"sentence":["'When are you going to sell that painting?' 'I "," (already sell) it.' 'Really? For how much?' 'They "," (buy) it for €9,000. However, I "," (not receive) the money for it yet.'"],"solutions":[["have already sold"],["bought"],["haven't received","have not received"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have already sold. It's present perfect because it expresses that this action has already happened contrary to what the speaker believed.","Corr: bought. It's past simple because this action connect to a past event (when they bought it). It's not about a period that comes up to now.","Corr: haven't received. It's present perfect because it's about a time period that comes up to now and about an action that still has not happened."]},{"id":5,"sentence":["'"," you "," (hear) that Peter has published a new book?' 'Yes, I ",". What's more, I "," (already buy) it.' 'Really? When "," you "," (buy) it?' 'Last week. However, I "," (not start) reading it yet.'"],"solutions":[["Have"],["heard"],["have"],["have already bought"],["did"],["buy"],["haven't started","have not started"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because the speaker asks whether an action has happened up to now, something that can be expected to have happened.","Corr: heard. It's present perfect because the speaker asks whether an action has happened up to now, something that can be expected to have happened.","Corr: have. It's present perfect because it's a short answer to a question in present perfect. In short answers, only the contracted form is acceptable.","Corr: have already bought. It's present perfect because the speaker wants to express that he has done something before it's expected.","Corr: did. It's past simple because the question contains 'When', so we're asking about a specific time in the past.","Corr: buy. It's past simple because the question contains 'When', so we're asking about a specific time in the past.","Corr: haven't started. It's present perfect because the speaker expresses that an action hasn't happened yet, even if it's expected that it has already happened."]}]}