{"title":"Present Perfect - already, yet - 3","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["Silvia "," (leave) Bob, so now Bob is devastated. He "," (already drink) a bottle of vodka."],"solutions":[["has left"],["has already drunk"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: has left. It's present perfect because there's no time adverb and it's news and still true.","Corr: has already drunk. It's present perfect because it expresses  that something has happened earlier than expected."]},{"id":1,"sentence":["When I "," (leave) home in the morning, I "," (not be) hungry, but now I "," (already eat) three sandwiches."],"solutions":[["left"],["wasn't","was not"],["have already eaten"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: left. It's past simple because there's 'when' in the sentence, so it's about a concrete time point in the past.","Corr: wasn't. It's past simple because there's 'when' in the sentence, so it's about a concrete time point in the past.","Corr: have already eaten. It's present perfect because it expresses that these actions happened earlier than expected."]},{"id":2,"sentence":["'"," you "," (find) a new job yet?' 'Yes, I "," . I "," (start) work last week.'"],"solutions":[["Have"],["found"],["have"],["started"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because it's a question whether something has happened up to now or not.","Corr: found. It's present perfect because it's a question whether something has happened up to now or not.","Corr: have. It's a short answer to a question in present perfect.","Corr: started. It's past simple because of the time adverb 'last week'."]},{"id":3,"sentence":["'Do you like Pynchon's new book?' 'Well, actually, I "," (not start) reading it yet.' 'Oh, what a pity! I "," (finish) it just now and I can say it's great.'"],"solutions":[["haven't started","have not started"],["finished"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: haven't started. It's present perfect because it's about an action that we have not done up to the present moment even if it was expected.","Corr: finished. It's past simple because of the time adverb 'just now', which means 'a moment ago'."]},{"id":4,"sentence":["I "," (put) in an ad only last week, but I "," (already have) a lot of job offers."],"solutions":[["put"],["have already had"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: put. It's past simple because of the time adverb 'last week'.","Corr: have already had. It's present perfect because it expresses that some actions have happened earlier than expected. The speaker has got more offers than he expected."]},{"id":5,"sentence":["'"," the doctor "," (arrive) yet?' 'No, he "," . But we don't need him. I "," (already vomit) the poison.'"],"solutions":[["Has"],["arrived"],["hasn't"],["have already vomited"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Has. It's present perfect because it's a question about whether an action has happened up to now. An action that we're expecting to happen.","Corr: arrived. It's present perfect because it's a question about whether an action has happened up to now. An action that we're expecting to happen.","Corr: hasn't. It's a short answer to a question in present perfect.","Corr: have already vomited. It's present perfect because the speaker wants to express that the vomiting happened earlier than expected."]}]}