{"title":"Present Perfect - already, yet - 2","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'I think this work will take a long time to finish.' 'Well, actually, we "," (already finish).' 'Really? When "," you "," (finish) it?'"],"solutions":[["have already finished"],["did"],["finish"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have already finished. It's present perfect because it's about an action that finished earlier than expected.","Corr: did. It's past simple because there's 'when' in it, so it's a question about a concrete time point.","Corr: finish. It's past simple because there's 'when' in it, so it's a question about a concrete time point."]},{"id":1,"sentence":["'Unfortunately, we "," (not find) a solution to this problem.' 'No problem. I "," (already phone) the boss and "," (tell) him that we won't finish in time.'"],"solutions":[["haven't found","have not found"],["have already phoned"],["have told"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: haven't found. It's present perfect because it's about a time period that comes up to now. There's something we still have not done.","Corr: have already phoned. It's present perfect because it's about an action that happened earlier than expected.","Corr: have told. It's present perfect because it's about an action that happened earlier than expected, it's the continuation of the previous clause."]},{"id":2,"sentence":["'"," you "," (book) a hotel room yet?' 'Yes, I "," . What's more I "," (already buy) a guide book about this place.'"],"solutions":[["Have"],["booked"],["have"],["have already bought"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because it's a question whether the other person has done something up to the present moment.","Corr: booked. It's present perfect because it's a question whether the other person has done something up to the present moment.","Corr: have. It'a short answer to a question in present perfect.","Corr: have already bought. It's present perfect because the speaker wants to express that he or she had done something earlier than expected."]},{"id":3,"sentence":["'"," you "," (eat) your sandwich?' 'No, I "," , but I'll finish it in a minute.'"],"solutions":[["Have"],["eaten"],["haven't"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's present perfect because it's a question whether an action has finished up to the present moment or not.","Corr: eaten. It's present perfect because it's a question whether an action has finished up to the present moment or not.","Corr: haven't. It's a short answer to a question in present perfect."]},{"id":4,"sentence":["'When "," you "," (buy) all these presents?' 'I "," (buy) them last week. However, I "," (not buy) a present for my father.'"],"solutions":[["did"],["buy"],["bought"],["haven't bought","have not bought"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: did. It's past simple because there's 'when' in the question so it's about a concrete time point in the past.","Corr: buy. It's past simple because there's 'when' in the question so it's about a concrete time point in the past.","Corr: bought. It's past simple because of the time adverb 'last week'.","Corr: haven't bought. It's present perfect because it's about something we haven't done up to the present moment. We could write 'yet' at the end of the sentence."]},{"id":5,"sentence":["'I'll lend you this book as soon as possible, but I "," (not finish) it yet. I "," (already get) over the half of it, but it's 600 pages.' 'No problem. I "," (buy) it yesterday.'"],"solutions":[["haven't finished","have not finished"],["have already got"],["bought"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: haven't finished. It's present perfect because the speaker has not done something up the to present moment.","Corr: have already got. It's present perfect because the speaker expresses that he or she has done something earlier than expected. And there's no time adverb.","Corr: bought. It's past simple because of the time adverb 'yesterday'."]}]}