{"title":"Present Simple or Continuous","instructions":"Complete the sentences with the verbs in the pop-up box. You will need B1present simpleB2 or B1present continuousB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["I "," (take) the kids to school, but this week my wife "," (take) them because I "," (work) late."],"solutions":[["take"],["is taking"],["am working"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: take. It's a habit, so we need  the present simple.","Corr: is taking. This is a temporary thing, so we need the continuous. It's happening this way only this week.","Corr: am working. It's a temporary thing, it's happening only this week, so we need the continuous."]},{"id":1,"sentence":["'Where's Jack?' 'He's in the kitchen. He "," (wash) up the dishes.' 'No way! He never "," (do) any housework.'"],"solutions":[["is washing"],["does"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: is washing. It's happening now, so we need the continuous.","Corr: does. It's a habit, a repeated action. The adverb 'never' refers to this."]},{"id":2,"sentence":["I "," (drive) home now, but it "," (snow), so I'll be late, I'm afraid."],"solutions":[["am driving"],["is snowing"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: am driving. It's happening now.","Corr: is snowing. It's happening now."]},{"id":3,"sentence":["'Who "," you "," (talk) to? Is it your mom?' 'No, shh, I "," (speak) to our boss. He "," (want) me to go back to work now.'"],"solutions":[["are"],["talking"],["am speaking"],["wants"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr. are. We need the continuous because it's happening now.","Corr. talking. We need the continuous because it's happening now.","Corr. am speaking. We need the continuous because it's happening now.","Corr: wants. The verb 'want' cannot be used in the continuous."]},{"id":4,"sentence":["'Tracy "," (prepare) for an important exam, so she can't come with us to the cinema.' 'What a pity! I "," (not prepare) for exams so carefully. I "," (not care) about what mark I "," (get)."],"solutions":[["is preparing"],["don't prepare","do not prepare"],["don't care","do not care"],["get"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: is preparing. It's happening now, so we need the continuous.","Corr: don't prepare. It's about a habit, so we need the present simple.","Corr: don't care. The verb 'care' is not used in the continuous.","Corr: get. It's a repeated action, so we need the present simple."]},{"id":5,"sentence":["'What "," you "," (do) for a living?' 'Well, I'm a freelancer. I "," (write) articles for political newspapers and magazines.' 'I "," (see). "," you "," (travel) a lot?' 'Yes, I "," . For example, next week I "," (fly) to Damascus.'"],"solutions":[["do"],["do"],["write"],["see"],["Do"],["travel"],["do"],["am flying"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: do. It's about a repeated action, so it's present simple. The question asks about the person's job.","Corr: do. It's about a repeated action, so it's present simple. The question asks about the person's job.","Corr: write. It's about a repeated action, the person's job, so it's present simple.","Corr: see. It means 'understand' and the verb 'see' in this meaning is not used in the continuous.","Corr: Do. The question is about a repeated action or a habit, so it's present simple.","Corr: travel. The question is about a repeated action or a habit, so it's present simple.","Corr: do. It's a short answer to a question in the present simple, so it's enough to repeat the auxiliary verb: do.","Corr: am flying. It's happening tomorrow, so a future action, a plan, and we know the time when it's happening, so it's continuous."]}]}