{"title":"Present perfect - have you ever","instructions":"Complete the sentences with the verbs in brackets. Use B1present perfectB2 or B1past simpleB2.","weight":"1","exa":null,"type":"1","helps":[""],"contents":[{"id":0,"sentence":["'We're going to the cinema tomorrow. We "," (not take) Jim, our son, there, so we're all excited about it.' 'I'm sure he'll enjoy it. Our daughter is 6, too, and she "," (be) to the cinema a lot. She loves it.'"],"solutions":[["haven't taken","have not taken"],["has been"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: haven't taken. It's about the person's life up to now, so it's present perfect.","Corr: has been. It's about the person's life up to now, so it's present perfect."]},{"id":1,"sentence":["'Is it true you "," (never be) abroad?' 'Yes, it is. I'm 26, but I "," (never leave) my own country. What's more, I "," (not be) farther than the neighbouring villages.'"],"solutions":[["have never been"],["have never left"],["haven't been","have not been"]],"userTipps":"GGG_GGG_GGG_GGG_","explain":["Corr: have never been. It's about the person's life up to now, so it's present perfect.","Corr: have never left. It's about the person's life up to now, so it's present perfect.","Corr: haven't been. It's about the person's life up to now, so it's present perfect."]},{"id":2,"sentence":["So I have to press this button if I want to print out a document. Well, nobody "," (ever tell) this to me."],"solutions":[["has ever told"]],"userTipps":"GGG_GGG_","explain":["Corr: has ever told. It's about the person's life up to now, so it's present perfect."]},{"id":3,"sentence":["'"," you "," (ever fly) in a helicopter?' 'Oh, no, I "," . Once, when I "," (be) a child, I "," (fly) in a small Cessna, so, as you can see, I "," (not fly) much in my life.'"],"solutions":[["Have"],["ever flown"],["haven't"],["was"],["flew"],["haven't flown","have not flown"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_GGG_GGG_","explain":["Corr: have. The question is about the person's life up to the present, so it's present perfect.","Corr: ever flown. The question is about the person's life up to the present, so it's present perfect.","Corr: haven't. It's a short answer to a question in present perfect, so it's enough to repeat the auxiliary verb 'have' or if it's a negative sentence: 'haven't'.","Corr: was. It's in the past, there's the word 'when' in the sentence, so it's past simple.","Corr: flew. It was in the past when the speaker was a child, so it's past simple.","Corr: haven't flown. It's about the person's experience up to now, so it's present perfect."]},{"id":4,"sentence":["'"," you "," (ever drink) tequila?' 'No, I "," . I don't like alcohol. I "," (never drink) wine, either.'"],"solutions":[["Have"],["ever drunk"],["haven't"],["have never drunk"]],"userTipps":"GGG_GGG_GGG_GGG_GGG_","explain":["Corr: Have. It's about the person's life so far, so it's present perfect.","Corr: ever drunk. It's about the person's life so far, so it's present perfect.","Corr: haven't. It's a short answer to a question in present perfect, so it's enough to repeat the auxiliary, 'have' or 'haven't'.","Corr: have never drunk. It's about the person's life so far, so it's present perfect."]},{"id":5,"sentence":["Our dog is very friendly. He "," (never bite) anyone. Though yesterday he "," (growl) at the postman."],"solutions":[["has never bit"],["growled"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: has never bit. It's about the dog's life up to now, so it's present perfect.","Corr: growled. There's the time adverb 'yesterday' in the sentence, so it's past simple."]}]}