{"title":"Relative Clauses All 2","instructions":"Complete the sentences with the appropriate relative pronoun, B1whichB2, B1thatB2, B1whoB2, B1whomB2, B1nothingB2 or B1whatB2.","weight":"2","exa":null,"type":"1","helps":["RELCLS\/relative_cls_1.html"],"contents":[{"id":0,"sentence":["In this book there're a lot of words "," I don't know the meaning of."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. We refer back to a noun (words), so we cannot use 'what'. And we can leave out the relative pronoun because it's the object of the relative clause."]},{"id":1,"sentence":["'You can't always get "," you need.' That's "," my experience tells me about life."],"solutions":[["what"],["what"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: Here the relative pronoun comes immediately after a verb (get), so there's no noun to refer back to, and so we cannot use 'which' or 'that'.","Corr: Here the relative pronoun comes immediately after a verb (is), so there's no noun to refer back to, and so we cannot use 'which' or 'that'."]},{"id":2,"sentence":["Unfortunately, I still haven't won back the money "," I lost at poker."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. Here we refer back to a noun (money) so we need 'which' or 'that'. But we can leave out the relative pronoun because it's the object of the relative clause."]},{"id":3,"sentence":["'Was that all "," she told you about this incident?' 'Yes, or at least, that was "," she wanted me to believe.'"],"solutions":[["which","that","GGG"],["what"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: that, which or nothing. We refer back to a noun (all), so we cannot use 'what', only 'which' or 'that' are correct. However, if there's 'all' in the sentence, 'that' is a better solution. Or, as the relative pronoun is the object of the relative clause, we can leave it out.","Corr: what. Here there's no noun after the verb (be), so we cannot refer back to it with 'which' or 'that'. Therefore only 'what' is correct."]},{"id":4,"sentence":["I tried to sit calmly because the chair on "," I was sitting was quite shaky."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. There's a preposition so we need to use a relative pronoun and we refer back to a noun (chair), so we can use only 'which'. 'that' is not used after prepositions."]},{"id":5,"sentence":["The books "," stood on the shelf looked quite boring. The one "," I took off was about Rousseau."],"solutions":[["which","that"],["which","that","GGG"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which or that. The relative pronoun here refers back to a noun so it cannot be 'what'. And we cannot leave it out because it's the subject of the relative clause.","Corr: which, that or nothing. We refer back to a noun (one), so we cannot use 'what'. As the relative pronoun is the object of the relative clause, we can leave it out."]},{"id":6,"sentence":["I don't really like the teachers "," teach at this school."],"solutions":[["who","that"]],"userTipps":"GGG_GGG_","explain":["Corr: who or that. We refer back to persons, so we need to use 'who' or 'that'. And we cannot leave it out because it's the subject of the relative clause."]},{"id":7,"sentence":["The route "," my satnav suggested was not exactly "," I thought to be the best."],"solutions":[["which","that","GGG"],["what"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which, that or nothing. We refer back to a noun (route), so we cannot use 'what'. We can leave out the relative pronoun because it's the object of the relative clause.","Corr: what. Here there's no noun to refer back to, so we cannot use 'which' or 'that'. There's is just the verb 'was', which is not followed by a noun. That's why only 'what' is correct."]},{"id":8,"sentence":["In this game, the monsters "," I kill can come back to life."],"solutions":[["which","that","who","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that, who or nothing. We refer back to a noun (monsters), so we cannot use 'what'. As the relative pronoun is the object of the relative clause, we can leave it out."]},{"id":9,"sentence":["My wife didn't like the villages through "," we drove while we were in France."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. We refer back to a noun (villages), so we cannot use 'what'. As there's a preposition, we cannot use 'that'."]}]}