{"title":"Relative Clauses - Which, That or Nothing 2","instructions":"Complete the sentences with the appropriate relative pronoun, B1whichB2, B1thatB2 or wherever it is possible B1nothingB2.","weight":"2","exa":null,"type":"1","helps":["RELCLS\/relative_cls_1.html"],"contents":[{"id":0,"sentence":["There are memories "," we forget because our brain deletes them."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. We can leave out the relative pronoun because it is not the subject of the relative clause. The subject of it is: 'we'."]},{"id":1,"sentence":["So this is the house of "," I've always dreamt since my early childhood."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. There's a preposition (of), so we have to use a relative pronoun. It cannot be 'that' because it cannot be used after prepositions."]},{"id":2,"sentence":["Unfortunately, I deleted a file "," contained important information about this app."],"solutions":[["which","that"]],"userTipps":"GGG_GGG_","explain":["Corr: which or that. Here we cannot leave out the relative pronoun because it is the subject of the relative clause."]},{"id":3,"sentence":["You should see your shrink about the nightmares "," you've had recently."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. Here we can leave out the relative pronoun because it's not the subject of the relative clause. The subject of it is: 'you'."]},{"id":4,"sentence":["The police can't find the gun with "," I killed my boss."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. Here we need to use a relative pronoun because there's a preposition (with). And this pronoun cannot be 'that' because it cannot be used after prepositions."]},{"id":5,"sentence":["When did you lose the book "," I lent you?"],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. Here we can leave out the relative pronoun because it's not the subject of the relative clause. Its subject is: 'I'."]},{"id":6,"sentence":["I'd like to buy a toy "," is good for a three-year old boy."],"solutions":[["which","that"]],"userTipps":"GGG_GGG_","explain":["Corr: which or that. Here we need to use a relative pronoun because it's the subject of the relative clause."]},{"id":7,"sentence":["They said that the power station beside "," they wanted to build houses would close down."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. There's a preposition (beside) here, so we need to use a relative pronoun. It cannot be 'that' because it cannot be used after prepositions."]},{"id":8,"sentence":["The company for "," I worked when I was young went bankrupt long ago."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. There's a preposition (for) here, so we need to use a relative pronoun. It cannot be 'that' because it cannot be used after prepositions."]},{"id":9,"sentence":["This is the only painkiller "," can help me. The one "," you gave me was useless."],"solutions":[["which","that"],["which","that","GGG"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which or that. Here the relative pronoun is the subject of the relative clause, so we cannot leave it out. As there's 'only' in the sentence, 'that' is better solution than 'which'.","Corr: which, that or nothing. Here we can leave out the relative pronoun because it is not the subject of the relative clause. Its subject is 'you'."]}]}