{"title":"Relative Clauses All 1","instructions":"Complete the sentences with the appropriate relative pronoun, B1whichB2, B1thatB2, B1whoB2, B1whomB2, B1nothingB2 or B1whatB2.","weight":"2","exa":null,"type":"1","helps":["RELCLS\/relative_cls_1.html"],"contents":[{"id":0,"sentence":["You can't always eat "," you find in the fridge."],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. After the verb 'eat' there's no noun, so we need to use 'what'."]},{"id":2,"sentence":["The analists "," we asked about this problem all suggested the same solution."],"solutions":[["whom","who","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: who, whom or nothing. We refer to persons (analists) so we have to use 'who' or 'whom'. The relative pronoun here is the object of the relative clause, so 'whom' is a good choice, but 'who' is acceptable, too. Or we can leave out the relative pronoun."]},{"id":3,"sentence":["Unfortunately, all the efforts "," I made to save the ship failed."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. The relative pronoun is not the subject of the relative clause, so we can leave it out. Otherwise, we refer back to a noun (the efforts), so we cannot use 'what'."]},{"id":4,"sentence":["According to "," this article says, we can expect another financial crisis."],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. There's no noun  to refer back to, so we need to use 'what'."]},{"id":5,"sentence":["I don't know the person to "," this letter is addressed."],"solutions":[["who","whom"]],"userTipps":"GGG_GGG_","explain":["Corr: who or whom. There's a preposition (to), so we need to use a relative pronoun. Both 'who' and 'whom' are correct, but 'whom' is a better choice because it's the object of a preposition."]},{"id":6,"sentence":["My parents will never understand "," I want from life."],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, just a verb (understand), so only 'what' is correct."]},{"id":7,"sentence":["There're people "," criticize others very easily, while they don't do anything."],"solutions":[["who","that"]],"userTipps":"GGG_GGG_","explain":["Corr: who or that. The relative pronoun is the subject of the relative clause, so we need to include one, and as we refer to persons, we need to use 'who' or 'that'."]},{"id":8,"sentence":["The business acumen for "," Warren was so famous is the thing of the past now."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. There's a preposition, so we need to use a relative pronoun and we refer back to a noun (acumen), so only 'which' is correct. We can't use 'that' here because it cannot be used after prepositions."]},{"id":9,"sentence":["I hate my colleagues. They laugh at the jokes "," I tell them."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. We refer back to a noun (the jokes), so we cannot use 'what'. And we can leave out the relative pronoun because it's the object of the relative clause."]},{"id":10,"sentence":["The dress "," my girlfriend was wearing at the party amazed everybody."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. We refer back to a noun (the dress), so we cannot use 'what'. And we can leave out the relative pronoun because it's the object of the relative clause."]}]}