{"title":"Relative Clauses All 2","instructions":"Complete the sentences with the appropriate relative pronoun, B1whichB2, B1thatB2, B1whoB2, B1whomB2, B1nothingB2 or B1whatB2.","weight":"2","exa":null,"type":"1","helps":["RELCLS\/relative_cls_1.html"],"contents":[{"id":0,"sentence":["In connection with "," you said about the project, I have a few questions to ask."],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so 'which' or 'that' is not correct."]},{"id":1,"sentence":["They ran out of money, "," is why they don't want to fulfill our contract."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. We refer back to a whole sentence, and there's a comma, too, so 'that' is not correct."]},{"id":2,"sentence":["Are you fully aware of "," you've done to us?"],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so 'which' and 'that' are not correct."]},{"id":3,"sentence":["My first car ("," was a Mini) would be 25 years old today."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. It's a non-defining relative clause, it is separated by brackets, so here 'that' is not correct. We refer back to a noun (a Mini), so we cannot use 'what'."]},{"id":4,"sentence":["Can you give me a document "," contains some information about "," I'm supposed to do here?"],"solutions":[["which","that"],["what"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which or that. We refer back to a noun (a document), so we cannot use 'what'. As the relative pronoun is the subject of the relative clause, we cannot leave it out.","Corr: what. Here we do not refer back to a noun. The relative clause is the object of a preposition (about)."]},{"id":5,"sentence":["The story "," we're going to see a film about takes place in the future."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. We refer back to a noun (the story), so we cannot use 'what'. As the relative pronoun is the not the subject of the relative clause, we can leave it out. The subject is 'we'."]},{"id":6,"sentence":["They didn't invite us to their wedding, "," may mean that they hate us."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. Here we don't refer back to a noun, but we refer back to the whole sentnece. In such cases only 'which' is correct, and a comma is used before it."]},{"id":7,"sentence":["During our holidays, everything "," could go wrong went wrong."],"solutions":[["that"]],"userTipps":"GGG_GGG_","explain":["Corr: that or which. We need to include a relative pronoun because it's the subject of the relative clause. We refer back to a noun (everything), so we cannot use 'what'. Because of 'everything', 'that' is a better solution than 'which'. The use of 'which' would sound quite unnatural."]},{"id":8,"sentence":["I don't know "," Jenny sees in George. He's the meanest guy "," I've ever met."],"solutions":[["what"],["who","that","whom","GGG"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so we cannot use 'that' or 'which'.","Corr: who, whom, that or nothing. Here we refer back to a person, so 'what' is not correct. As the relative pronoun is not subject of the relative clause, we can leave it out."]},{"id":9,"sentence":["The incessant noise "," came from the street made me crazy."],"solutions":[["that","which"]],"userTipps":"GGG_GGG_","explain":["Corr: which or that. We refer back to a noun (noise), so we cannot use 'what'. The relative pronoun is the subject of the relative clause, so we cannot leave it out."]}]}