{"title":"Relative Clauses All 3","instructions":"Complete the sentences with the appropriate relative pronoun, B1whichB2, B1thatB2, B1whoB2, B1whomB2, B1nothingB2 or B1whatB2.","weight":"2","exa":null,"type":"1","helps":["RELCLS\/relative_cls_1.html"],"contents":[{"id":0,"sentence":["What was the series of events "," made him change his life for ever?"],"solutions":[["which","that"]],"userTipps":"GGG_GGG_","explain":["Corr: which or that. We refer back to a noun (series of events), so we cannot use 'what'. We need to include the relative pronoun because it's the subject of the relative clause."]},{"id":1,"sentence":["If the spaceship goes a few miles off course, in "," case we'll only get notified, we won't need to take steps "," can bring her back."],"solutions":[["which"],["that","which"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which. There's a preposition, and we refer to the whole previous clause, so 'what' is not correct. It's a non-defining clause, so 'that' is not correct either.","Corr: that or which. We refer back to a noun, so we cannot use 'what'. We cannot leave out the relative pronoun because it's the subject of the relative clause."]},{"id":2,"sentence":["The clown's laughter, "," resounded in the whole house, sent a shiver down my spine."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. It's a non-defining relative clause separated by commas, so 'that' is not correct. As we refer back to a noun (laughter), we cannot use 'what'."]},{"id":3,"sentence":["Will they ever understand "," I'm trying to say?"],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so 'which' and 'that' are not correct. Here 'what' comes immediately after the verb (understand)."]},{"id":4,"sentence":["Our latest development is this vest through "," no bullet can go."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. We refer back to a noun (vest), so we cannot use 'what'. We need to include the relative pronoun because there's a preposition (through). Here 'that' wouldn't be correct because it is not used after prepositions."]},{"id":5,"sentence":["It was totally dark, and my legs bumped into "," felt like a coffee table."],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so we cannot use 'which' or 'that'."]},{"id":6,"sentence":["I'm still thinking about "," my therapist told me. Don't get angry about things "," you cannot control."],"solutions":[["what"],["which","that","GGG"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so 'that' and 'which' are not correct. The verb 'thinking about' is immediately followed by a noun clause, introduced by 'what'.","Corr: which, that or nothing. We refer back to a noun (things), so we cannot use 'what'. We can leave out the relative pronoun because it's not the subject of the relative clause."]},{"id":7,"sentence":["The silver bullet "," you're holding in your hand went through my armour and lodged in my heart, "," proved fatal."],"solutions":[["which","that","GGG"],["which"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which, that or nothing. We refer to a noun (bullet) so 'what' is not okay. As the relative pronoun is not the subject of the relative clause, we can leave it out.","Corr: which. Here we refer back to the whole clause, and in such cases only 'which' is correct."]},{"id":8,"sentence":["My favourite dish - "," my girlfriend can make very well - is salmon steak with wild rice."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. It's a non-defining relative clause, so we can use only 'which'."]},{"id":9,"sentence":["I kinda agree with "," Rousseau contended about the harmful effects "," society can have on us."],"solutions":[["what"],["which","that","GGG"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so we cannot use 'which' or 'that'.","Corr: which, that or nothing. We refer back to a noun (effects), so we cannot use 'what'. We can leave out the relative pronoun because it's not the subject of the relative clause."]}]}