{"title":"Relative Clauses All 1","instructions":"Complete the sentences with the appropriate relative pronoun, B1whichB2, B1thatB2, B1whoB2, B1whomB2, B1nothingB2 or B1whatB2.","weight":"2","exa":null,"type":"1","helps":["RELCLS\/relative_cls_1.html"],"contents":[{"id":0,"sentence":["The dog barked all night, "," kept us all awake."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. It's a sentence relative. The relative clause refers to the whole sentence, so only 'which' is correct. And there's a comma!"]},{"id":1,"sentence":["Mont Blanc, "," is thought to be the highest mountain in Europe, is just the second after Elbrus."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. It's a non-defining relative clause, which is signified by the two commas, too. It's not necessary to further define Mont Blanc."]},{"id":2,"sentence":["The train station at "," we got off proved to be the wrong one."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. There's a preposition, so we cannot leave out the pronoun, and we cannot use 'that' because it's not used after prepositions. We refer back to a noun (station), so 'what' is also incorrect."]},{"id":3,"sentence":["It is in this context "," these concepts can be differentiated the easiest."],"solutions":[["that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: that or nothing. This is an 'it is ... that' structure, so 'that' is best solution here, or we can leave it out because it's not the subject of the relative clause."]},{"id":4,"sentence":["Was your son surprised at "," he saw in the box?"],"solutions":[["what"]],"userTipps":"GGG_GGG_","explain":["Corr: what. There's no noun to refer back to, so we cannot use 'which' or 'that'."]},{"id":5,"sentence":["The house in "," we live is 200 years old."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. We refer to a noun (the house), so we cannot use 'what'. We cannot leave out the relative pronoun because there's a preposition. We cannot use 'that' because it cannot be used after prepositions."]},{"id":6,"sentence":["The conclusions "," the committee arrived at follows from "," they had experienced at our firm."],"solutions":[["which","that","GGG"],["what"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which, that or nothing. We refer back to a noun (conclusions) so we cannot use 'what'. We can leave out the relative pronoun because it's not the subject or the relative clause. Its subject is 'the committee'.","Corr: what. There's no noun to refer back to, so 'that' or 'which' are not correct."]},{"id":7,"sentence":["The enthusiasm "," I play this game with will never die down."],"solutions":[["which","that","GGG"]],"userTipps":"GGG_GGG_","explain":["Corr: which, that or nothing. We refer back to a noun, so 'what' is not correct here. We can leave out the relative pronoun because it's not the subject of the relative clause."]},{"id":8,"sentence":["I know there're things "," can distract you, yet you should concentrate on "," you're doing."],"solutions":[["which","that"],["what"]],"userTipps":"GGG_GGG_GGG_","explain":["Corr: which or that. We refer back to a noun (things), so we can't use 'what'. We can't leave out the relative pronoun because it's the subject of the relative clause.","Corr: what. There's no noun to refer back to, so 'what' comes immediately after the verb and preposition 'concentrate on'."]},{"id":9,"sentence":["His first book - "," achieved only moderate success - was followed by his most famous novel."],"solutions":[["which"]],"userTipps":"GGG_GGG_","explain":["Corr: which. It's a non-defining clause, and we refer back to a noun, so only 'which' is correct. The non-defining clause is separated by dashes (-)."]}]}